crud/app/controllers/produtos_controller.rb

SELECT  "produtos".* FROM "produtos"  ORDER BY "produtos"."nome" ASC LIMIT 5
SELECT  "produtos".* FROM "produtos"  ORDER BY "produtos"."preco" ASC LIMIT 2
---
	def index
        @produtos_por_nome = Produto.order(:nome).limit 5
        @produtos_por_preco = Produto.order(:preco).limit 2

SELECT "departamentos".* FROM "departamentos"
---
	def edit
	   @departamentos = Departamento.all

UPDATE "produtos" SET "nome" = ?, "descricao" = ?, "departamento_id" = ?, "updated_at" = ? WHERE "produtos"."id" = ?  [["nome", "Camisa de gatonomia"], ["descricao", "Camiseta mais ou menos legal de gato"], ["departamento_id", 3], ["updated_at", "2016-05-06 13:30:32.977393"], ["id", 2]]
---
	def update

	    valores = produto_params
	    if @produto.update valores

INSERT INTO "produtos" ("nome", "preco", "descricao", "quantidade", "departamento_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["nome", "vander"], ["preco", 1.0], ["descricao", "vander "], ["quantidade", 1], ["departamento_id", 2], ["created_at", "2016-05-05 14:36:52.204433"], ["updated_at", "2016-05-05 14:36:52.204433"]]
---
    def create
    	valores = produto_params
    	@produto = Produto.new valores
		if @produto.save

DELETE FROM "produtos" WHERE "produtos"."id" = ?  [["id", 7]]
---
	def destroy

		@produto.destroy

SELECT "produtos".* FROM "produtos" WHERE (nome like '%camisa%')
---
	def busca
    	@nome_a_buscar = params[:nome]
    	@produtos = Produto.where "nome like ?", "%#{@nome_a_buscar}%"

SELECT  "produtos".* FROM "produtos" WHERE "produtos"."id" = ? LIMIT 1  [["id", 7]]
---
	def set_produto
    	id = params[:id]
   		@produto = Produto.find(id)